; domain
; remove negative-precondition for powerlifted
; source: https://github.com/AI-Planning/pddl-generators/blob/main/ferry/domain.pddl
; updates: typing car and locations; sail precs have now (not (at-ferry ?to)) so (not-eq ?from ?to) can be removed
(define (domain ferry)
    (:requirements :typing :strips)
    ; (:requirements :typing :strips :negative-preconditions)
    (:types
        car - object
        location - object
    )

    (:predicates
        (at-ferry ?l - location)
        (at ?c - car ?l - location)
        (empty-ferry)
        (on ?c - car)
    )

    (:action sail
        :parameters (?from - location ?to - location)
        :precondition (and
            (at-ferry ?from)
            ; (not (at-ferry ?to))
        )
        :effect (and (at-ferry ?to) (not (at-ferry ?from)))
    )

    (:action board
        :parameters (?car - car ?loc - location)
        :precondition (and (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
        :effect (and
            (on ?car)
            (not (at ?car ?loc))
            (not (empty-ferry)))
    )

    (:action debark
        :parameters (?car - car ?loc - location)
        :precondition (and (on ?car) (at-ferry ?loc))
        :effect (and
            (at ?car ?loc)
            (empty-ferry)
            (not (on ?car)))
    )
)

; problem
;; cars=16, locations=13, out_folder=training/easy, instance_id=78, seed=108

(define (problem ferry-78)
 (:domain ferry)
 (:objects 
    car1 car2 car3 car4 car5 car6 car7 car8 car9 car10 car11 car12 car13 car14 car15 car16 - car
    loc1 loc2 loc3 loc4 loc5 loc6 loc7 loc8 loc9 loc10 loc11 loc12 loc13 - location
 )
 (:init 
    (empty-ferry)
    (at-ferry loc3)
    (at car1 loc12)
    (at car2 loc2)
    (at car3 loc11)
    (at car4 loc7)
    (at car5 loc12)
    (at car6 loc5)
    (at car7 loc7)
    (at car8 loc4)
    (at car9 loc2)
    (at car10 loc5)
    (at car11 loc4)
    (at car12 loc3)
    (at car13 loc4)
    (at car14 loc12)
    (at car15 loc6)
    (at car16 loc4)
)
 (:goal  (and (at car1 loc2)
   (at car2 loc5)
   (at car3 loc2)
   (at car4 loc10)
   (at car5 loc7)
   (at car6 loc2)
   (at car7 loc10)
   (at car8 loc7)
   (at car9 loc12)
   (at car10 loc8)
   (at car11 loc5)
   (at car12 loc12)
   (at car13 loc13)
   (at car14 loc10)
   (at car15 loc12)
   (at car16 loc1))))

; plan
1. (sail loc3 loc12)
   deleted: (at-ferry loc3)
   added: (at-ferry loc12)
   goals met: 0 of 16
2. (board car1 loc12)
   deleted: (at car1 loc12) (empty-ferry)
   added: (on car1)
   goals met: 0 of 16
3. (sail loc12 loc2)
   deleted: (at-ferry loc12)
   added: (at-ferry loc2)
   goals met: 0 of 16
4. (debark car1 loc2)
   deleted: (on car1)
   added: (at car1 loc2) (empty-ferry)
   goals met: 1 of 16
5. (board car2 loc2)
   deleted: (at car2 loc2) (empty-ferry)
   added: (on car2)
   goals met: 1 of 16
6. (sail loc2 loc5)
   deleted: (at-ferry loc2)
   added: (at-ferry loc5)
   goals met: 1 of 16
7. (debark car2 loc5)
   deleted: (on car2)
   added: (at car2 loc5) (empty-ferry)
   goals met: 2 of 16
8. (sail loc5 loc11)
   deleted: (at-ferry loc5)
   added: (at-ferry loc11)
   goals met: 2 of 16
9. (board car3 loc11)
   deleted: (at car3 loc11) (empty-ferry)
   added: (on car3)
   goals met: 2 of 16
10. (sail loc11 loc2)
   deleted: (at-ferry loc11)
   added: (at-ferry loc2)
   goals met: 2 of 16
11. (debark car3 loc2)
   deleted: (on car3)
   added: (at car3 loc2) (empty-ferry)
   goals met: 3 of 16
12. (sail loc2 loc7)
   deleted: (at-ferry loc2)
   added: (at-ferry loc7)
   goals met: 3 of 16
13. (board car4 loc7)
   deleted: (at car4 loc7) (empty-ferry)
   added: (on car4)
   goals met: 3 of 16
14. (sail loc7 loc10)
   deleted: (at-ferry loc7)
   added: (at-ferry loc10)
   goals met: 3 of 16
15. (debark car4 loc10)
   deleted: (on car4)
   added: (at car4 loc10) (empty-ferry)
   goals met: 4 of 16
16. (sail loc10 loc12)
   deleted: (at-ferry loc10)
   added: (at-ferry loc12)
   goals met: 4 of 16
17. (board car5 loc12)
   deleted: (at car5 loc12) (empty-ferry)
   added: (on car5)
   goals met: 4 of 16
18. (sail loc12 loc7)
   deleted: (at-ferry loc12)
   added: (at-ferry loc7)
   goals met: 4 of 16
19. (debark car5 loc7)
   deleted: (on car5)
   added: (at car5 loc7) (empty-ferry)
   goals met: 5 of 16
20. (sail loc7 loc5)
   deleted: (at-ferry loc7)
   added: (at-ferry loc5)
   goals met: 5 of 16
21. (board car6 loc5)
   deleted: (at car6 loc5) (empty-ferry)
   added: (on car6)
   goals met: 5 of 16
22. (sail loc5 loc2)
   deleted: (at-ferry loc5)
   added: (at-ferry loc2)
   goals met: 5 of 16
23. (debark car6 loc2)
   deleted: (on car6)
   added: (at car6 loc2) (empty-ferry)
   goals met: 6 of 16
24. (sail loc2 loc7)
   deleted: (at-ferry loc2)
   added: (at-ferry loc7)
   goals met: 6 of 16
25. (board car7 loc7)
   deleted: (at car7 loc7) (empty-ferry)
   added: (on car7)
   goals met: 6 of 16
26. (sail loc7 loc10)
   deleted: (at-ferry loc7)
   added: (at-ferry loc10)
   goals met: 6 of 16
27. (debark car7 loc10)
   deleted: (on car7)
   added: (at car7 loc10) (empty-ferry)
   goals met: 7 of 16
28. (sail loc10 loc4)
   deleted: (at-ferry loc10)
   added: (at-ferry loc4)
   goals met: 7 of 16
29. (board car8 loc4)
   deleted: (at car8 loc4) (empty-ferry)
   added: (on car8)
   goals met: 7 of 16
30. (sail loc4 loc7)
   deleted: (at-ferry loc4)
   added: (at-ferry loc7)
   goals met: 7 of 16
31. (debark car8 loc7)
   deleted: (on car8)
   added: (at car8 loc7) (empty-ferry)
   goals met: 8 of 16
32. (sail loc7 loc2)
   deleted: (at-ferry loc7)
   added: (at-ferry loc2)
   goals met: 8 of 16
33. (board car9 loc2)
   deleted: (at car9 loc2) (empty-ferry)
   added: (on car9)
   goals met: 8 of 16
34. (sail loc2 loc12)
   deleted: (at-ferry loc2)
   added: (at-ferry loc12)
   goals met: 8 of 16
35. (debark car9 loc12)
   deleted: (on car9)
   added: (at car9 loc12) (empty-ferry)
   goals met: 9 of 16
36. (sail loc12 loc5)
   deleted: (at-ferry loc12)
   added: (at-ferry loc5)
   goals met: 9 of 16
37. (board car10 loc5)
   deleted: (at car10 loc5) (empty-ferry)
   added: (on car10)
   goals met: 9 of 16
38. (sail loc5 loc8)
   deleted: (at-ferry loc5)
   added: (at-ferry loc8)
   goals met: 9 of 16
39. (debark car10 loc8)
   deleted: (on car10)
   added: (at car10 loc8) (empty-ferry)
   goals met: 10 of 16
40. (sail loc8 loc4)
   deleted: (at-ferry loc8)
   added: (at-ferry loc4)
   goals met: 10 of 16
41. (board car11 loc4)
   deleted: (at car11 loc4) (empty-ferry)
   added: (on car11)
   goals met: 10 of 16
42. (sail loc4 loc5)
   deleted: (at-ferry loc4)
   added: (at-ferry loc5)
   goals met: 10 of 16
43. (debark car11 loc5)
   deleted: (on car11)
   added: (at car11 loc5) (empty-ferry)
   goals met: 11 of 16
44. (sail loc5 loc3)
   deleted: (at-ferry loc5)
   added: (at-ferry loc3)
   goals met: 11 of 16
45. (board car12 loc3)
   deleted: (at car12 loc3) (empty-ferry)
   added: (on car12)
   goals met: 11 of 16
46. (sail loc3 loc12)
   deleted: (at-ferry loc3)
   added: (at-ferry loc12)
   goals met: 11 of 16
47. (debark car12 loc12)
   deleted: (on car12)
   added: (at car12 loc12) (empty-ferry)
   goals met: 12 of 16
48. (sail loc12 loc4)
   deleted: (at-ferry loc12)
   added: (at-ferry loc4)
   goals met: 12 of 16
49. (board car13 loc4)
   deleted: (at car13 loc4) (empty-ferry)
   added: (on car13)
   goals met: 12 of 16
50. (sail loc4 loc13)
   deleted: (at-ferry loc4)
   added: (at-ferry loc13)
   goals met: 12 of 16
51. (debark car13 loc13)
   deleted: (on car13)
   added: (at car13 loc13) (empty-ferry)
   goals met: 13 of 16
52. (sail loc13 loc12)
   deleted: (at-ferry loc13)
   added: (at-ferry loc12)
   goals met: 13 of 16
53. (board car14 loc12)
   deleted: (at car14 loc12) (empty-ferry)
   added: (on car14)
   goals met: 13 of 16
54. (sail loc12 loc10)
   deleted: (at-ferry loc12)
   added: (at-ferry loc10)
   goals met: 13 of 16
55. (debark car14 loc10)
   deleted: (on car14)
   added: (at car14 loc10) (empty-ferry)
   goals met: 14 of 16
56. (sail loc10 loc6)
   deleted: (at-ferry loc10)
   added: (at-ferry loc6)
   goals met: 14 of 16
57. (board car15 loc6)
   deleted: (at car15 loc6) (empty-ferry)
   added: (on car15)
   goals met: 14 of 16
58. (sail loc6 loc12)
   deleted: (at-ferry loc6)
   added: (at-ferry loc12)
   goals met: 14 of 16
59. (debark car15 loc12)
   deleted: (on car15)
   added: (at car15 loc12) (empty-ferry)
   goals met: 15 of 16
60. (sail loc12 loc4)
   deleted: (at-ferry loc12)
   added: (at-ferry loc4)
   goals met: 15 of 16
61. (board car16 loc4)
   deleted: (at car16 loc4) (empty-ferry)
   added: (on car16)
   goals met: 15 of 16
62. (sail loc4 loc1)
   deleted: (at-ferry loc4)
   added: (at-ferry loc1)
   goals met: 15 of 16
63. (debark car16 loc1)
   deleted: (on car16)
   added: (at car16 loc1) (empty-ferry)
   goals met: 16 of 16
